Revit 2024 API
PointCloudOverrides Class
 Graphic overrides that are stored by a view to be applied to a PointCloudInstance element, or a scan within the element.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class PointCloudOverrides : IDisposable
Visual Basic
Public Class PointCloudOverrides _
	Implements IDisposable
Visual C++
public ref class PointCloudOverrides : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PointClouds.PointCloudOverrides
See Also
PointCloudOverrides Members
Autodesk.Revit.DB.PointClouds Namespace